Show / Hide Table of Contents
Struct StrainImpulse
Generalized strain load impulse.
Inherited Members
 System.ValueType.Equals(System.Object)
 System.ValueType.GetHashCode()
 System.ValueType.ToString()
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetType()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public struct StrainImpulse
Properties
Improve this Doc   View Source
EpsX
The normal strain.
Declaration
public double EpsX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaXY
The shear strain.
Declaration
public double GammaXY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaXZ
The shear strain.
Declaration
public double GammaXZ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
PhiX
The torsion slope around x axis.
Declaration
public double PhiX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
PhiY
The curvature around z axis.
Declaration
public double PhiY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
PhiZ
The curvature around y axis.
Declaration
public double PhiZ { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source